Repository: PoomSmart/YouPIP
Catalog: YouPiP_*.strings
Languages: ru

source: Non-backgroundable PiP
ru: Принудительный PiP

source: Enables PiP for non-backgroundable content.
ru: Активирует PiP (Картинка в Картинке) для контента, не поддерживающего PiP изначально.

source: Legacy PiP
ru: Оригинальный PiP

source: Uses AVPlayerLayer where there's no playback speed bug. This also removes UHD video quality options (2K/4K) from any videos. App restart is required.
ru: На основе AVPlayerLayer, в котором нет багов со скоростью воспроизведения. Данный режим отключает воспроизведение видео в ультра высоком разрешении (2K/4K). Потребуется перезапуск YouTube.

source: PiP Sample Buffer Hack
ru: Режим буферизации PiP

source: Implements PiP sample buffering based on iOS 15.0b5, which should reduce the chance of getting playback speedup bug. Turn off this option if you face weird issues. App restart is required.
ru: Реализует буферизацию образцов PiP на основе iOS 15 бета 5, тем самым уменьшает возможность багов со скоростью воспроизведения. Отключите данную опцию при наличии странных багов. Потребуется перезапуск YouTube.

source: Use PiP Button
ru: Активировать PiP вручную

source: Adds a PiP button over the video control overlay to activate PiP instead of dismissing the app. Enable this feature to prevent AutoPiP.
ru: Добавляет кнопку PiP (Картинка в Картинке) в панель навигации для активации PiP вручную. Включите данную опцию, чтобы PiP не срабатывал автоматически.

source: Use Video Tab Bar PiP Button
ru: Использовать кнопку PiP под плеером

source: Adds a PiP button in tab bar to activate PiP instead of dismissing the app. App restart is required.
ru: Добавляет кнопку PiP (Картинка в Картинке) в панель под видео для активации PiP вручную. Включите данную опцию, чтобы PiP не срабатывал автоматически. Потребуется перезапуск YouTube.

source: PiP starts paused
ru: Запуск PiP приостановлен

source: When PiP is activated, it's paused by default.
ru: Если PiP активирован, функция приостановлена по умолчанию.

source: YouTube version %@ is not tested and may not be supported by YouPiP, please upgrade YouTube to at least version %s
ru: Данная версия YouTube (%@) еще не протестирована и, возможно, неподдерживается YouPiP. Понизьте YouTube, как минимум, до версии %s
